holes/LDTS/example2/talk-contents.tex
% Created 2025-11-18 Tue 11:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=2cm]{geometry}
\author{Joseph Corneli}
\date{\today}
\title{Repository Transition}
\hypersetup{
 pdfauthor={Joseph Corneli},
 pdftitle={Repository Transition},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.8)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Summary:}
\label{sec:org18ffd7a}

INPUT → PROCESS → OUTPUT

\section{INPUT}
\label{sec:org2d1ad54}
\subsection{Core Claim}
\label{sec:org105c5d5}
A successful repository transition must begin from \textbf{who we are} and \textbf{what we are committed to}.

\subsection{Roles}
\label{sec:orgc246bab}
\begin{itemize}
\item Depositors
\item Downloaders (including external partners, supervisors, students, etc.)
\item Research Integrity \& Governance
\item REF/Impact team
\item Archivists
\item ?
\end{itemize}

\subsection{Values}
\label{sec:orgc085d6b}

``We celebrate, value, and provide equal opportunity to all.''

``We have confidence in our staff and students.''

``We’re adaptable and flexible; a fresh approach in everything we do.''

``Academic excellence is underpinned by learning by doing.''

``Open and willing to share abilities, knowledge, and experience.''

\subsection{The current research repository}
\label{sec:org660fd44}
RADAR is currently one among many (GitHub, Zenodo, Figshare, OSF, Octopus, disciplinary archives such as Dryad, etc.)
\begin{itemize}
\item \ldots{} in a ecosystem that increasingly prioritises \textbf{open research}.
\item \ldots{} and also one of many software systems at Brookes (Moodle, Panopto, ServiceNow, etc.)
\end{itemize}

\subsection{Input Summary}
\label{sec:org6939174}
This identity sets the structural constraints for any credible transformation.

\section{INPUT — Brief Observations}
\label{sec:org6465ec0}
\subsection{Invariants (true now and should be preserved in any transformation)}
\label{sec:org3b0b8a5}
\begin{itemize}
\item \textbf{Plurality}: Multiple forms of contribution, use, and recognition
\item \textbf{Trust}: clarity, data quality, rights metadata, ethical transparency
\item \textbf{Creativity}: Reuse, interdisciplinarity, linking
\item \textbf{Helpfulness}: User-friendly contribution pathways
\end{itemize}

\subsection{Diagnostics (motivating change!)}
\label{sec:orgf0bc237}

\begin{itemize}
\item Workarounds, tacit dependencies, brittle workflows, duplication of effort
\item Uneven visibility, unclear reuse pathways
\item Large data sets and “nontraditional outputs” that don’t thrive in RADAR
\item REF risk accumulates when “people, culture, and environment” drift in different directions
\end{itemize}

\section{OUTPUT — Strawman Projection}
\label{sec:org59c50f6}
\subsection{Core Claim}
\label{sec:org7b56142}
If we do nothing, current discrepancies will show up as systemic misalignment in the PCE portion of REF 2029.

\subsection{REF People, Culture \& Environment: Some failure modes}
\label{sec:org3061ad3}

\begin{itemize}
\item \textbf{“Strategy”}: reactive and ineffective planning → workflows that aren’t managed well
\item \textbf{“Responsibility”}: unclear governance → inconsistencies regarding rights and reuse
\item \textbf{“Connectivity”}: siloed or unusable deposits → brittle interdisciplinarity, little ecosystemic uptake
\item \textbf{“Inclusivity”}: accessibility gaps; uneven representation of actual research diversity
\item \textbf{“Development”}: training burden; reliance on librarian heroics
\end{itemize}

\subsection{Baseline Summary}
\label{sec:orgd0ec965}
Something along these lines is the “default future” if issues remain unaddressed.

\section{OUTPUT — The Research Emporium}
\label{sec:orgd2dcc14}
\subsection{Core Claim}
\label{sec:org2c2deed}
With identity invariants preserved and expanded, by taking compliance
as the floor and excellence as the ceiling, the research repository
can be an amazing asset to Brookes and one of the key assets in the
PCE.

\subsection{Core metaphor: Brookes Research Emporium}
\label{sec:org1762108}
\begin{itemize}
\item Showcases Brookes’ intellectual portfolio
\item Drives visibility, credibility, and external engagement
\item Turns open research into a value generator, not a cost centre
\item Aligns \textbf{Inclusivity}, \textbf{Enterprising Creativity}, and \textbf{Generosity of Spirit}
\end{itemize}

\subsection{Keep an eye on indicators of reuse:}
\label{sec:org97ded5a}
\begin{itemize}
\item \textbf{Footfall}: depth and diversity of visitors
\item \textbf{Portfolio exploration}: interdisciplinary browsing
\item \textbf{Inbound calls}: collaboration, consultancy, CPD enquiries
\item \textbf{Citation-motivated traffic}: evidence of reuse?
\item \textbf{Media/policy pick-up}: external resonance
\item \textbf{Reduced training burden}: more intuitive workflows
\item \textbf{Interdisciplinary signals}: cross-department search and linking
\item \textbf{Less stress}: fewer ad-hoc queries about rights, REF eligibility, embargoes
\end{itemize}

\subsection{Part of a much nicer PCE statement:}
\label{sec:org9e93dc8}

\begin{itemize}
\item \textbf{“Strategy”}: learning system replaces firefighting
\item \textbf{“Responsibility”}: governance becomes visible and light
\item \textbf{“Connectivity”}: workflows align across boundaries
\item \textbf{“Inclusivity”}: reflexivity drives representation
\item \textbf{“Development”}: capacity grows through practice
\end{itemize}

\subsection{Capability Summary}
\label{sec:org147efd6}
By doubling down on “intelligent openness” the repository becomes a significant \textbf{public-facing research asset}.

\section{PROCESS — The Transformation Engine}
\label{sec:org14e39e8}
\subsection{Core Claim}
\label{sec:orgb15aebf}
INPUT → PROCESS → OUTPUT

≈

Identity → Projection → Capability


This can be read as a \textbf{repeatable cycle} that evolves Brookes research
infrastructure\ldots{}
\begin{itemize}
\item safely, confidently, learning as we go.
\end{itemize}

\subsection{Step 1 — Zoom in on \textbf{Identity}}
\label{sec:org5a3f023}
Not just who we want to be but also our annoyances, frustrations, etc.:

\begin{description}
\item[{resonances \uline{and} tensions}] e.g., “as open as possible, as closed as necessary”
\item[{constraints \uline{and} pressures}] some shared (e.g., finance), some discipline-specific (e.g., data storage needs)
\end{description}

\subsection{Step 2 — Micro- \textbf{Projection}}
\label{sec:orgfc32d52}
Each “next step” should fit how collaborators actually work.

\begin{description}
\item[{Connect and build around the things that matter to people}] For most people it’s typically not a repository but their \emph{task}, \emph{care}, \emph{practice}, \emph{mission}, \ldots{}
\item[{Learn in a continuous improvement process}] real-time co-learning loops (e.g., librarians/RDM) vs parallel or more distant cycles (researchers/IT)
\end{description}

\subsection{Step 3 — Building \textbf{Capability}}
\label{sec:orge9fef94}
Increase our ability to carry out and empower excellent research, e.g., through

\begin{itemize}
\item Transparent workflows and analytics where relevant
\item Widening-out bottlenecks
\item Less heroic labour
\item Learning from the process!
\end{itemize}

\subsection{Step 4 — Iterate the above}
\label{sec:org72572ad}
What I have just talked through without using technical terminology is the concept of a \emph{design pattern}.

\begin{itemize}
\item \textbf{IF} (what is true) \textbf{HOWEVER} (there is still tension)
\item \textbf{THEN} (take best practice guidance for such a situation \emph{when it exists} \textbf{or} develop such guidance empirically)
\item \textbf{BECAUSE} (we should learn from what works!)
\end{itemize}

\subsection{PCE one last time:}
\label{sec:org347f524}

\begin{itemize}
\item \textbf{“Strategy”}: Not “perfect” workflows, but diagnostic patterns that dysfunction visible, tractable, and correctable.
\item \textbf{“Responsibility”}: Pattern-based templates make governance clearer without bureaucracy or formal restructuring.
\item \textbf{“Connectivity”}: Not a grand unified platform, but organic connection.
\item \textbf{“Inclusivity”}: Inclusiveness operationalised through reflective practice, evaluation protocol, and participatory design.
\item \textbf{“Development”}: Build on what worked best in the Open Research Programme: peer-led practice.
\end{itemize}

\subsection{Process Summary}
\label{sec:org5198718}
This transformation plan works \textbf{because it uses (1) time-tested and (2) culturally fine-tuned patterns} while respecting identity, rhythm, difference, and connection.

\section{Closing}
\label{sec:org9500568}
\subsection{In Conclusion}
\label{sec:orgecd6879}
A repository transition is best led using a lightweight, patterned
\textbf{identity → projection → capability} approach.

\subsection{References (My Research Emporium)}
\label{sec:org520c936}
If you’re wondering where the “tested” patterns come from? — I have spent the last decade building them.

\begin{itemize}
\item Peer Produced Peer Learning: A Mathematics Case Study (2014)
\item Patterns of Peeragogy (2015)
\item Patterns of Patterns (2021)
\item Patterns of Patterns II (2023)
\item Open Reseach Book (2025)
\item “Don’t wait for the REF to improve the research environment” (2025)
\item Patterns for a new generation (forthcoming)
\end{itemize}

\section{ANNEX}
\label{sec:orgf6adefe}
\subsection{Strategy}
\label{sec:orgf47499d}
\begin{itemize}
\item Strategy becomes \textbf{iteratively adaptive}: each pattern cycle (diagnose → prototype → evaluate → re-ground) generates actionable evidence.
\item Medium-term planning is structured around the \textbf{Transformation Engine} and backed by \textbf{compatibility maps} that clarify where cross-team interdependencies matter.
\item Instead of lurching from fire to fire, the organisation moves into a mode where \textbf{strategic foresight and operational readiness reinforce each other}.
\end{itemize}

\subsection{Responsibility}
\label{sec:orgdc8c51c}
\begin{itemize}
\item Rights and responsibilities are expressed through \textbf{micro-governance patterns}
(e.g., License Laddering, Institutional Drift reviews) that clarify who owns what decisions.
\item Governance becomes \textbf{legible and teachable}, reducing incidental gatekeeping.
\item Stewardship roles (e.g., pattern stewards, evidence stewards) are small, rotating,
and embedded in normal practice rather than being heroic exceptions.
\end{itemize}

\subsection{Connectivity}
\label{sec:orgf7a88af}
\begin{itemize}
\item Connectivity emerges from \textbf{interoperability-by-design}: compatibility mapping across units helps align expectations before infrastructure decisions are locked in.
\item Patterned development generates \textbf{shared mental models} across disciplines, improving cross-team translation and reducing friction.
\item Deposits and workflows are not “open by default” in a performative sense, but \textbf{integrative by pattern}: interactions and handoffs are deliberately designed.
\end{itemize}

\subsection{Inclusivity}
\label{sec:orgb908e2a}
\begin{itemize}
\item Inclusivity is not an add-on; it’s baked into the \textbf{pattern elicitation process}, where lived experience becomes design evidence.
\item Reflexive workshops ensure minority voices shape pattern revisions.
\item The system becomes \textbf{locally accountable}: each cycle captures who is being served and who is being missed.
\end{itemize}

\subsection{Development}
\label{sec:org20297ab}
\begin{itemize}
\item Capability development becomes \textbf{embedded in workflow}, not delivered as extra labour.
\item Patterns provide “minimum viable upskilling”: just enough structure to act,
plus a safe cycle for review and adjustment.
\item Expertise becomes \textbf{distributed}: knowledge resides in documented cycles
and shared artefacts rather than in a small number of heroes.
\end{itemize}

\subsubsection{Underlying mechanism}
\label{sec:orgad1dd97}
\textbf{Pattern cycle = structured evidence flow → better decisions → stronger culture.}
\end{document}